.OpenPFO/case_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

xmin -10;
xmax 10;
ymin -2;
ymax 2;
zmin -2;
zmax 2;

dx 0.05;
dy 0.05;
dz 0.05;

lx #calc "$xmax - $xmin";
ly #calc "$ymax - $ymin";
lz #calc "$zmax - $zmin";

xcells #calc "abs(($lx)/($dx))";
ycells #calc "abs(($ly)/($dy))";
zcells #calc "abs(($lz)/($dz))";

vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)
    ($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading ( 1 1 1 )
);

edges
(
);

boundary
(
    minX
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    maxX
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    minY
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    maxY
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    minZ
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

    maxZ
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
)

mergePatchPairs
(
);

// ************************************************************************* //
