.OpenPFO/case_template/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    writeInterval   5;

    log             yes;

    patches         (jobGeometry);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;           // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0.375 0 0);  // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         10;
    lRef            1.5;        // Wheelbase length
    Aref            0.7125;        // Estimated
}



// ************************************************************************* //
