.OpenPFO/case_template/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

jobGeometry.stl
{
    // How to obtain raw features (extractFromFile || extractFromSurface)
    extractionMethod extractFromSurface;

    // Identify a feature when angle between faces < includedAngle
    // - 0   : selects no edges
    // - 180 : selects all edges
    includedAngle 180;

    subsetFeatures
    {
        // Keep manifold edges (edges with >2 connected faces)
        nonManifoldEdges yes;

        // Keep open edges (edges with 1 connected face)
        openEdges yes;
    }

    // Write features to obj format for postprocessing
    writeObj no;
    verboseObj no;

    // Write surface proximity and curvature fields to vtk format
    // for postprocessing
    writeVTK no;
}